Revit 2027 API
FailureMessageAccessor.HasResolutionOfType Method
 Checks if failure has a resolution of a given type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasResolutionOfType(
	FailureResolutionType type
)
Public Function HasResolutionOfType (
	type As FailureResolutionType
) As Boolean
public:
bool HasResolutionOfType(
	FailureResolutionType type
)
member HasResolutionOfType :
        type : FailureResolutionType -> bool
Parameters
type FailureResolutionType
 The type of resolution.
Return Value
Boolean
 True if failure has a resolution of a given type, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace